#
# Tap the "usual" kegs
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "mas-cli/tap"

#
# Install our favorite commands
#
brew "ack"
brew "aspell"
brew "ca-certificates"
brew "certbot"
brew "colordiff"
brew "cscope"
brew "ctags"
brew "curl"
brew "exiftool"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "glib"
brew "gource"
brew "graphviz"
brew "heroku/brew/heroku"
brew "hub"
brew "imagemagick"
brew "jq"
brew "mas"
brew "mysql"
brew "ncftp"
brew "node"
brew "p7zip"
brew "postgis"
brew "postgresql@11", restart_service: true
brew "python@2", link: false
brew "rbenv"
brew "ruby", link: true
brew "ruby-build"
brew "telnet"
brew "the_silver_searcher"
brew "tmux"
brew "watch"
brew "webp"
brew "wget"
brew "wine"
brew "wireshark"

#
# Identify the casks for our Mac tools
#
cask "android-platform-tools"
cask "dbeaver-community"
cask "disk-inventory-x"
cask "docker"
cask "emacs"
cask "gimp"
cask "java"
cask "macdown"
cask "macvim"

#
# Install the Apple Store apps that we love
#
mas "Amphetamine", id: 937984704
mas "GarageBand", id: 682658836
mas "Harvest", id: 506189836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "MKPlayer", id: 1335612105
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "SMARTReporter", id: 509148961
mas "Trello", id: 1278508951
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
